cases/openfoam.org/catalystHeatUp/constant/SCR1/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    //- Frozen water at -5 (engineeringtoolbox.com)
    specie
    {
        nMoles      1;
        molWeight   60.06;
    }

    transport
    {
        kappa   2;
    }

    thermodynamics
    {
        Hf      0;

        // Old version used Cp
        //Cp      744;

        // New verion use Cp - Cv = R / M
        Cv     605.56;
    }

    equationOfState
    {
        // 100 percentaage solid
        //rho     2650;
        // 10 percent
        rho 265;
    }
}

// ************************************************************************* //
