cases/openfoam.org/catalystHeatUp/system/SCR2/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//- This is an arbitrary name of the object
//  Has to set in the other region (other region -> fluid)
Coupling
{
    // OpenFOAM offers three different kind of heat transfers between regions
    // a) constant
    //    Here, we set up the surface area / volume ratio in the AoV
    //    , e.g., if we do have a catalyst, we know the ratio
    //    Furthermore, we set a constant heat-transfer-coefficient (HTC) in
    //    W/m^2/K 
    //
    // b) variable
    //    Here, one solves the following correlation:
    //    Nu = a * pow(Re, b) * pow(Pr, c)
    //   
    //    htc = Nu * K / ds
    //
    //    K := heat conduction
    //    ds:= struct diameter / characteristic length
    //    a, b, c are parameters to modify the Nu calculation
    // 
    // c) function1 option
    // d) function2 option

    type                interRegionHeatTransfer;

    interRegionHeatTransferCoeffs
    {
        type                constant;
        nbrRegionName       fluid;              // << Neigbour region name
        interpolationMethod cellVolumeWeight;   // << Different possibilites
                                                //    set wrong name and start
                                                //    the solver to see the
                                                //    options (banana trick)
        nbrModel            Coupling2;          // << Name of fvOption object
                                                //    in neighour region
                                                //    this one is named
                                                //    'Coupling' << of line 20
        fields              (h);                // Field that is coupled
        semiImplicit        false;              // Semi-Implicit calculation

        AoV                 1400;
        htc                 120;


        // Model parameter for b)
        //    a                   1;
        //    b                   0.5;
        //    c                   1.2;
    }
}


// ************************************************************************* //
